Tekla Open API Reference for Tekla Structures 2025
AnalysisPartAreaAttributes.AreaSupport Property
Note: This API is now obsolete.
 Gets or sets the area support.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[ObsoleteAttribute("Deprecated. Value is not used anymore. Please use AreaSupportType instead.",
	false)]
public AnalysisPartAreaAttributes.AreaSupportEnum AreaSupport { get; set; }
<ObsoleteAttribute("Deprecated. Value is not used anymore. Please use AreaSupportType instead.",
	false)>
Public Property AreaSupport As AnalysisPartAreaAttributes.AreaSupportEnum
	Get
	Set
Property Value
Type: AnalysisPartAreaAttributes.AreaSupportEnum
See Also
Reference
AnalysisPartAreaAttributes Class
Tekla.Structures.Analysis Namespace